IDEA Open Model
Hanging.EndsType Property
Compatible with IDEA StatiCa v 10.1
 End type of the reinforcement bar - same for both ends
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public LongReinfEndType EndsType { get; set; }
Public Property EndsType As LongReinfEndType
	Get
	Set
public:
property LongReinfEndType EndsType {
	LongReinfEndType get ();
	void set (LongReinfEndType value);
}
Property Value
Type: LongReinfEndType
See Also
Reference
Hanging Class
IdeaRS.OpenModel.Detail Namespace